app/views/assignments/_form.html.erb

SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]
---
    <%= form.label :store_id, :class=>"active" %>
    <%= form.select :store_id, Store.active.collect { |p| p.id }, include_blank: true %>

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
    <%= form.label :employee_id, :class=>"active"  %>
    <%= form.select :employee_id, Employee.active.collect { |p| p.id }, include_blank: true %>