app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
  def index
    @employee = current_employee
    if @employee !=nil then
      if @employee.role == "admin"
         @assignments = Assignment.all

INSERT INTO "assignments" ("store_id", "employee_id", "start_date", "pay_level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["store_id", 1], ["employee_id", 1], ["start_date", "2010-04-16"], ["pay_level", 4], ["created_at", "2019-04-02 09:16:01.993632"], ["updated_at", "2019-04-02 09:16:01.993632"]]
---
  def create
    @assignment = Assignment.new(assignment_params)

    respond_to do |format|
      if @assignment.save

UPDATE "assignments" SET "pay_level" = ?, "updated_at" = ? WHERE "assignments"."id" = ?  [["pay_level", 3], ["updated_at", "2019-04-02 14:36:45.513302"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @assignment.update(assignment_params)