app/controllers/employees_controller.rb

  def active
    @employees = Employee.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]

  def inactive
    @employees = Employee.inactive.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 0], ["LIMIT", 10], ["OFFSET", 0]]

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "ssn", "date_of_birth", "phone", "role", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)