app/controllers/stores_controller.rb

SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
---
  def active
    @stores = Store.active.alphabetical.paginate(:page => params[:page]).per_page(10)

SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? ORDER BY name LIMIT ? OFFSET ?  [["active", 0], ["LIMIT", 10], ["OFFSET", 0]]
---
  def inactive
    @stores = Store.inactive.alphabetical.paginate(:page => params[:page]).per_page(10)

INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "latitude", "longitude", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "active" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["active", 1], ["updated_at", "2019-04-01 13:09:08.102661"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)