app/models/assignment.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def end_previous_assignment
    current_assignment = Employee.find(self.employee_id).current_assignment

SELECT "employees".* FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
  def employee_is_active_in_system
    all_active_employees = Employee.active.all.map{|e| e.id}

SELECT "stores".* FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]
---
  def store_is_active_in_system
    all_active_stores = Store.active.all.map{|s| s.id}