app/models/employee.rb

  def current_assignment
    curr_assignment = self.assignments.select{|a| a.end_date.nil?}
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ?  [["employee_id", 1]]